---
kind: other
id: Methods.T:Autodesk.Revit.DB.FormUtils
source: html/a02c6a18-d5ee-c839-ecd4-c700665c2c2a.htm
---
# FormUtils Methods

Validates that input contains one or more form elements or geom combinations containing form elements.